
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>介绍 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="validator-setup.html" />
    
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        <li class="header">PLUGChain 使用手册</li>
        
        
    
        <li class="chapter " data-level="1.1" >
            
                <span>
            
                    
                    PLUGChain
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.1.1" >
            
                <span>
            
                    
                    介绍
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.1.1.1" data-path="../../">
            
                <a href="../../">
            
                    
                    什么是 PLUGChain ?
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.1.1.2" >
            
                <span>
            
                    
                    加入社区
            
                </span>
            

            
        </li>
    

            </ul>
            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    开始
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="../installation.html">
            
                <a href="../installation.html">
            
                    
                    安装 PLUGChain
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="../testnet.html">
            
                <a href="../testnet.html">
            
                    
                    加入到 PLUGChain 测试网
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" >
            
                <span>
            
                    
                    加入到 PLUGChain 主网-开发中
            
                </span>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../node/">
            
                <a href="../node/">
            
                    
                    节点知识
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" >
            
                <span>
            
                    
                    钱包和地址
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="../basic/accounts-faq.html">
            
                <a href="../basic/accounts-faq.html">
            
                    
                    介绍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="../basic/accounts.html">
            
                <a href="../basic/accounts.html">
            
                    
                    使用
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" >
            
                <span>
            
                    
                    交易
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" data-path="../basic/tx.html">
            
                <a href="../basic/tx.html">
            
                    
                    转账
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.2" data-path="../basic/txs.html">
            
                <a href="../basic/txs.html">
            
                    
                    交易步骤
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.6" >
            
                <span>
            
                    
                    验证者
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="1.6.1" data-path="validator-faq.html">
            
                <a href="validator-faq.html">
            
                    
                    介绍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6.2" data-path="validator-setup.html">
            
                <a href="validator-setup.html">
            
                    
                    使用
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.7" >
            
                <span>
            
                    
                    委托人
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.7.1" data-path="../delegators/deleggator-faq.md">
            
                <span>
            
                    
                    介绍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7.2" data-path="../delegators/delegator-setup.html">
            
                <a href="../delegators/delegator-setup.html">
            
                    
                    使用
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="../api/swagger-api.html">
            
                <a href="../api/swagger-api.html">
            
                    
                    API服务
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="../basic/genesis.html">
            
                <a href="../basic/genesis.html">
            
                    
                    创世文件genesis.json
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" >
            
                <span>
            
                    
                    自动化做市商-开发中
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" >
            
                <span>
            
                    
                    代币-开发中
            
                </span>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="../.." >介绍</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <!--
title:验证者
-->
<h1 id="&#x9A8C;&#x8BC1;&#x5668;&#x5E38;&#x89C1;&#x95EE;&#x9898;">&#x9A8C;&#x8BC1;&#x5668;&#x5E38;&#x89C1;&#x95EE;&#x9898;</h1>
<h3 id="&#x4EC0;&#x4E48;&#x662F;&#x9A8C;&#x8BC1;&#x5668;&#xFF1F;">&#x4EC0;&#x4E48;&#x662F;&#x9A8C;&#x8BC1;&#x5668;&#xFF1F;</h3>
<p>Plugchain &#x57FA;&#x4E8E; <a href="https://tendermint.com/docs/introduction/what-is-tendermint.html" target="_blank">Tendermint</a>&#xFF0C;&#x5B83;&#x4F9D;&#x8D56;&#x4E00;&#x7EC4;&#x9A8C;&#x8BC1;&#x5668;&#x6765;&#x4FDD;&#x62A4;&#x7F51;&#x7EDC;&#x3002;&#x9A8C;&#x8BC1;&#x8005;&#x7684;&#x4F5C;&#x7528;&#x662F;&#x8FD0;&#x884C;&#x4E00;&#x4E2A;&#x5168;&#x8282;&#x70B9;&#x5E76;&#x901A;&#x8FC7;&#x5E7F;&#x64AD;&#x5305;&#x542B;&#x7531;&#x5176;&#x79C1;&#x94A5;&#x7B7E;&#x540D;&#x7684;&#x52A0;&#x5BC6;&#x7B7E;&#x540D;&#x7684;&#x6295;&#x7968;&#x6765;&#x53C2;&#x4E0E;&#x5171;&#x8BC6;&#x3002;&#x9A8C;&#x8BC1;&#x8005;&#x5728;&#x533A;&#x5757;&#x94FE;&#x4E2D;&#x63D0;&#x4EA4;&#x65B0;&#x533A;&#x5757;&#x5E76;&#x83B7;&#x5F97;&#x6536;&#x5165;&#x4EE5;&#x6362;&#x53D6;&#x4ED6;&#x4EEC;&#x7684;&#x5DE5;&#x4F5C;&#x3002;&#x4ED6;&#x4EEC;&#x8FD8;&#x5FC5;&#x987B;&#x901A;&#x8FC7;&#x5BF9;&#x63D0;&#x6848;&#x8FDB;&#x884C;&#x6295;&#x7968;&#x6765;&#x53C2;&#x4E0E;&#x6CBB;&#x7406;&#x3002;&#x9A8C;&#x8BC1;&#x8005;&#x6839;&#x636E;&#x4ED6;&#x4EEC;&#x7684;&#x603B;&#x6743;&#x76CA;&#x52A0;&#x6743;&#x3002;</p>
<h3 id="&#x4EC0;&#x4E48;&#x662F;&#x8D28;&#x62BC;&#xFF1F;">&#x4EC0;&#x4E48;&#x662F;&#x8D28;&#x62BC;&#xFF1F;</h3>
<p>Plugchain &#x662F;&#x4E00;&#x4E2A;&#x516C;&#x5171;&#x7684;&#x6743;&#x76CA;&#x8BC1;&#x660E; (PoS) &#x533A;&#x5757;&#x94FE;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x9A8C;&#x8BC1;&#x8005;&#x7684;&#x6743;&#x91CD;&#x53D6;&#x51B3;&#x4E8E;&#x4F5C;&#x4E3A;&#x62B5;&#x62BC;&#x54C1;&#x7684;&#x62B5;&#x62BC;&#x4EE3;&#x5E01; (plug) &#x7684;&#x6570;&#x91CF;&#x3002;&#x8FD9;&#x4E9B;&#x63D2;&#x4EF6;&#x53EF;&#x4EE5;&#x7531;&#x9A8C;&#x8BC1;&#x8005;&#x76F4;&#x63A5;&#x81EA;&#x884C;&#x59D4;&#x6258;&#x6216;&#x7531;&#x5176;&#x4ED6;&#x63D2;&#x4EF6;&#x6301;&#x6709;&#x8005;&#x59D4;&#x6258;&#x7ED9;&#x4ED6;&#x4EEC;&#x3002;</p>
<p>&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x4EFB;&#x4F55;&#x7528;&#x6237;&#x90FD;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x53D1;&#x9001;&#x201C;&#x521B;&#x5EFA;&#x9A8C;&#x8BC1;&#x5668;&#x201D;&#x4EA4;&#x6613;&#x6765;&#x58F0;&#x660E;&#x4ED6;&#x4EEC;&#x6210;&#x4E3A;&#x9A8C;&#x8BC1;&#x5668;&#x7684;&#x610F;&#x56FE;&#x3002;&#x4ECE;&#x90A3;&#x91CC;&#xFF0C;&#x4ED6;&#x4EEC;&#x6210;&#x4E3A;&#x9A8C;&#x8BC1;&#x8005;&#x5019;&#x9009;&#x4EBA;&#x3002;</p>
<p>&#x9A8C;&#x8BC1;&#x8005;&#x7684;&#x6743;&#x91CD;&#xFF08;&#x5373;&#x6295;&#x7968;&#x6743;&#xFF09;&#x51B3;&#x5B9A;&#x4E86;&#x4ED6;&#x4EEC;&#x662F;&#x5426;&#x662F;&#x6D3B;&#x8DC3;&#x7684;&#x9A8C;&#x8BC1;&#x8005;&#x3002;&#x6700;&#x521D;&#xFF0C;&#x53EA;&#x6709;&#x62E5;&#x6709;&#x6700;&#x591A;&#x6295;&#x7968;&#x6743;&#x7684;&#x524D; 100 &#x540D;&#x9A8C;&#x8BC1;&#x8005;&#x624D;&#x4F1A;&#x6210;&#x4E3A;&#x6D3B;&#x8DC3;&#x9A8C;&#x8BC1;&#x8005;&#x3002;</p>
<h3 id="&#x4EC0;&#x4E48;&#x662F;&#x5168;&#x8282;&#x70B9;&#xFF1F;">&#x4EC0;&#x4E48;&#x662F;&#x5168;&#x8282;&#x70B9;&#xFF1F;</h3>
<p>&#x5168;&#x8282;&#x70B9;&#x662F;&#x4E00;&#x4E2A;&#x5B8C;&#x5168;&#x9A8C;&#x8BC1;&#x533A;&#x5757;&#x94FE;&#x4EA4;&#x6613;&#x548C;&#x533A;&#x5757;&#x7684;&#x7A0B;&#x5E8F;&#x3002;&#x5B83;&#x4E0D;&#x540C;&#x4E8E;&#x4EC5;&#x5904;&#x7406;&#x533A;&#x5757;&#x5934;&#x548C;&#x4E00;&#x5C0F;&#x90E8;&#x5206;&#x4EA4;&#x6613;&#x7684;&#x8F7B;&#x8282;&#x70B9;&#x3002;&#x8FD0;&#x884C;&#x5168;&#x8282;&#x70B9;&#x9700;&#x8981;&#x6BD4;&#x8F7B;&#x8282;&#x70B9;&#x66F4;&#x591A;&#x7684;&#x8D44;&#x6E90;&#xFF0C;&#x4F46;&#x8FD9;&#x662F;&#x6210;&#x4E3A;&#x9A8C;&#x8BC1;&#x8005;&#x6240;&#x5FC5;&#x9700;&#x7684;&#x3002;&#x5728;&#x5B9E;&#x8DF5;&#x4E2D;&#xFF0C;&#x8FD0;&#x884C;&#x5168;&#x8282;&#x70B9;&#x4EC5;&#x610F;&#x5473;&#x7740;&#x4EE5;&#x4F4E;&#x7F51;&#x7EDC;&#x5EF6;&#x8FDF;&#x548C;&#x65E0;&#x505C;&#x673A;&#x65F6;&#x95F4;&#x8FD0;&#x884C;&#x975E;&#x59A5;&#x534F;&#x548C;&#x6700;&#x65B0;&#x7248;&#x672C;&#x7684;&#x8F6F;&#x4EF6;&#x3002;</p>
<p>&#x5F53;&#x7136;&#xFF0C;&#x5373;&#x4F7F;&#x4ED6;&#x4EEC;&#x4E0D;&#x6253;&#x7B97;&#x6210;&#x4E3A;&#x9A8C;&#x8BC1;&#x8005;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x5E76;&#x9F13;&#x52B1;&#x7528;&#x6237;&#x8FD0;&#x884C;&#x5168;&#x8282;&#x70B9;&#x3002;</p>
<h3 id="&#x4EC0;&#x4E48;&#x662F;&#x59D4;&#x6258;&#x4EBA;&#xFF1F;">&#x4EC0;&#x4E48;&#x662F;&#x59D4;&#x6258;&#x4EBA;&#xFF1F;</h3>
<p>&#x59D4;&#x6258;&#x4EBA;&#x662F;&#x4E0D;&#x80FD;&#x6216;&#x4E0D;&#x60F3;&#x81EA;&#x5DF1;&#x8FD0;&#x884C;&#x9A8C;&#x8BC1;&#x5668;&#x7684;&#x63D2;&#x4EF6;&#x6301;&#x6709;&#x8005;&#x3002;&#x63D2;&#x4EF6;&#x6301;&#x6709;&#x8005;&#x53EF;&#x4EE5;&#x5C06;&#x63D2;&#x4EF6;&#x59D4;&#x6258;&#x7ED9;&#x9A8C;&#x8BC1;&#x8005;&#x5E76;&#x4F5C;&#x4E3A;&#x4EA4;&#x6362;&#x83B7;&#x5F97;&#x4ED6;&#x4EEC;&#x7684;&#x90E8;&#x5206;&#x6536;&#x5165;</p>
<p>&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x4E0E;&#x9A8C;&#x8BC1;&#x4EBA;&#x5206;&#x4EAB;&#x6536;&#x5165;&#xFF0C;&#x6240;&#x4EE5;&#x59D4;&#x6258;&#x4EBA;&#x4E5F;&#x5206;&#x62C5;&#x98CE;&#x9669;&#x3002;&#x5982;&#x679C;&#x9A8C;&#x8BC1;&#x8005;&#x884C;&#x4E3A;&#x4E0D;&#x7AEF;&#xFF0C;&#x4ED6;&#x4EEC;&#x7684;&#x6BCF;&#x4E2A;&#x59D4;&#x6258;&#x4EBA;&#x5C06;&#x6839;&#x636E;&#x5176;&#x59D4;&#x6258;&#x7684;&#x80A1;&#x4EFD;&#x6BD4;&#x4F8B;&#x88AB;&#x90E8;&#x5206;&#x524A;&#x51CF;&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x59D4;&#x6258;&#x4EBA;&#x5E94;&#x8BE5;&#x5728;&#x59D4;&#x6258;&#x4E4B;&#x524D;&#x5BF9;&#x9A8C;&#x8BC1;&#x4EBA;&#x8FDB;&#x884C;&#x5C3D;&#x804C;&#x8C03;&#x67E5;&#xFF0C;&#x5E76;&#x5C06;&#x4ED6;&#x4EEC;&#x7684;&#x80A1;&#x4EFD;&#x5206;&#x914D;&#x7ED9;&#x591A;&#x4E2A;&#x9A8C;&#x8BC1;&#x4EBA;&#x3002;</p>
<p>&#x59D4;&#x6258;&#x4EBA;&#x5728;&#x7CFB;&#x7EDF;&#x4E2D;&#x8D77;&#x7740;&#x81F3;&#x5173;&#x91CD;&#x8981;&#x7684;&#x4F5C;&#x7528;&#xFF0C;&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x8D1F;&#x8D23;&#x9009;&#x62E9;&#x9A8C;&#x8BC1;&#x4EBA;&#x3002;&#x4F5C;&#x4E3A;&#x59D4;&#x6258;&#x4EBA;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x88AB;&#x52A8;&#x7684;&#x89D2;&#x8272;&#xFF1A;&#x59D4;&#x6258;&#x4EBA;&#x5E94;&#x8BE5;&#x79EF;&#x6781;&#x76D1;&#x63A7;&#x9A8C;&#x8BC1;&#x4EBA;&#x7684;&#x884C;&#x4E3A;&#x5E76;&#x53C2;&#x4E0E;&#x6CBB;&#x7406;&#x3002;&#x6709;&#x5173;&#x66F4;&#x591A;&#x4FE1;&#x606F;&#xFF0C;&#x8BF7;&#x9605;&#x8BFB; <a href="../delegators/delegator-faq.md">&#x59D4;&#x6258;&#x4EBA;&#x5E38;&#x89C1;&#x95EE;&#x9898;&#x89E3;&#x7B54;</a>&#x3002;</p>
<h2 id="&#x6210;&#x4E3A;&#x9A8C;&#x8BC1;&#x8005;">&#x6210;&#x4E3A;&#x9A8C;&#x8BC1;&#x8005;</h2>
<h3 id="&#x5982;&#x4F55;&#x6210;&#x4E3A;&#x9A8C;&#x8BC1;&#x8005;&#xFF1F;">&#x5982;&#x4F55;&#x6210;&#x4E3A;&#x9A8C;&#x8BC1;&#x8005;&#xFF1F;</h3>
<p>&#x7F51;&#x7EDC;&#x4E2D;&#x7684;&#x4EFB;&#x4F55;&#x53C2;&#x4E0E;&#x8005;&#x90FD;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x53D1;&#x9001;&#x201C;create-validator&#x201D;&#x4EA4;&#x6613;&#x6765;&#x8868;&#x793A;&#x4ED6;&#x4EEC;&#x60F3;&#x6210;&#x4E3A;&#x9A8C;&#x8BC1;&#x8005;&#xFF0C;&#x4ED6;&#x4EEC;&#x5FC5;&#x987B;&#x586B;&#x5199;&#x4EE5;&#x4E0B;&#x53C2;&#x6570;&#xFF1A;</p>
<ul>
<li><strong>Validator&apos;s <code>PubKey</code>&#xFF1A;</strong> &#x4E0E; Tendermint <code>PubKey</code> &#x5173;&#x8054;&#x7684;&#x79C1;&#x94A5;&#x7528;&#x4E8E;&#x7B7E;&#x7F72; <em>prevotes</em> &#x548C; <em>precommits</em>&#x3002;</li>
<li><strong>&#x9A8C;&#x8BC1;&#x8005;&#x5730;&#x5740;&#xFF1A;</strong> &#x5E94;&#x7528;&#x5C42;&#x5730;&#x5740;&#x3002;&#x8FD9;&#x662F;&#x7528;&#x4E8E;&#x516C;&#x5F00;&#x8BC6;&#x522B;&#x60A8;&#x7684;&#x9A8C;&#x8BC1;&#x8005;&#x7684;&#x5730;&#x5740;&#x3002;&#x4E0E;&#x6B64;&#x5730;&#x5740;&#x5173;&#x8054;&#x7684;&#x79C1;&#x94A5;&#x7528;&#x4E8E;&#x59D4;&#x6258;&#x3001;&#x89E3;&#x9664;&#x7ED1;&#x5B9A;&#x3001;&#x9886;&#x53D6;&#x5956;&#x52B1;&#x548C;&#x53C2;&#x4E0E;&#x6CBB;&#x7406;&#x3002;</li>
<li><strong>&#x9A8C;&#x8BC1;&#x8005;&#x7684;&#x540D;&#x5B57;(moniker)</strong></li>
<li><strong>&#x9A8C;&#x8BC1;&#x8005;&#x7684;&#x7F51;&#x7AD9;(website)</strong></li>
<li><strong>&#x9A8C;&#x8BC1;&#x8005;&#x7684;&#x63CF;&#x8FF0;</strong></li>
<li><strong>details</strong>&#xFF1A;    &#x9A8C;&#x8BC1;&#x5668;&#x7684;&#xFF08;&#x53EF;&#x9009;&#xFF09;&#x8BE6;&#x7EC6;&#x4FE1;&#x606F;                  </li>
<li><strong>Initial commission rate</strong>&#xFF1A;&#x533A;&#x5757;&#x5956;&#x52B1;&#x548C;&#x5411;&#x59D4;&#x6258;&#x4EBA;&#x6536;&#x53D6;&#x7684;&#x8D39;&#x7528;&#x7684;&#x4F63;&#x91D1;&#x7387;&#x3002;</li>
<li><strong>Maximum commission</strong>&#xFF1A; &#x8BE5;&#x9A8C;&#x8BC1;&#x5668;&#x53EF;&#x4EE5;&#x6536;&#x53D6;&#x7684;&#x6700;&#x5927;&#x4F63;&#x91D1;&#x7387;&#x3002;&#x5904;&#x7406;&#x5B8C; <code>create-validator</code> &#x540E;&#x65E0;&#x6CD5;&#x66F4;&#x6539;&#x6B64;&#x53C2;&#x6570;&#x3002;</li>
<li><strong>Commission max change rate</strong>&#xFF1A; &#x9A8C;&#x8BC1;&#x4EBA;&#x4F63;&#x91D1;&#x7684;&#x6700;&#x5927;&#x6BCF;&#x65E5;&#x589E;&#x91CF;&#x3002;&#x5904;&#x7406;&#x5B8C; <code>create-validator</code> &#x540E;&#x65E0;&#x6CD5;&#x66F4;&#x6539;&#x6B64;&#x53C2;&#x6570;&#x3002;</li>
<li><strong>Minimum self-delegation</strong>&#xFF1A; &#x9A8C;&#x8BC1;&#x8005;&#x9700;&#x8981;&#x59CB;&#x7EC8;&#x7ED1;&#x5B9A;&#x7684;&#x6700;&#x5C0F;&#x63D2;&#x4EF6;&#x6570;&#x91CF;&#x3002;&#x5982;&#x679C;&#x9A8C;&#x8BC1;&#x8005;&#x7684;&#x81EA;&#x59D4;&#x6258;&#x6743;&#x76CA;&#x4F4E;&#x4E8E;&#x6B64;&#x9650;&#x5236;&#xFF0C;&#x5219;&#x4ED6;&#x4EEC;&#x7684;&#x6574;&#x4E2A;&#x6743;&#x76CA;&#x6C60;&#x5C06;&#x89E3;&#x9664;&#x7ED1;&#x5B9A;&#x3002;</li>
</ul>
<p>&#x521B;&#x5EFA;&#x9A8C;&#x8BC1;&#x5668;&#x540E;&#xFF0C;&#x63D2;&#x4EF6;&#x6301;&#x6709;&#x8005;&#x53EF;&#x4EE5;&#x5C06;&#x63D2;&#x4EF6;&#x59D4;&#x6258;&#x7ED9;&#x4ED6;&#x4EEC;&#xFF0C;&#x4ECE;&#x800C;&#x6709;&#x6548;&#x5730;&#x5C06;&#x6743;&#x76CA;&#x6DFB;&#x52A0;&#x5230;&#x4ED6;&#x4EEC;&#x7684;&#x6C60;&#x4E2D;&#x3002;&#x4E00;&#x4E2A;&#x5730;&#x5740;&#x7684;&#x603B;&#x6743;&#x76CA;&#x662F;&#x59D4;&#x6258;&#x4EBA;&#x7ED1;&#x5B9A;&#x7684;plug&#x548C;&#x81EA;&#x5DF1;&#x6307;&#x5B9A;&#x7684;&#x5B9E;&#x4F53;&#x81EA;&#x5DF1;&#x7ED1;&#x5B9A;&#x7684;plug&#x7684;&#x7EC4;&#x5408;&#x3002;</p>
<p>&#x5728;&#x6240;&#x6709;&#x5411;&#x81EA;&#x5DF1;&#x53D1;&#x51FA;&#x4FE1;&#x53F7;&#x7684;&#x9A8C;&#x8BC1;&#x8005;&#x5019;&#x9009;&#x4EBA;&#x4E2D;&#xFF0C;&#x603B;&#x6743;&#x76CA;&#x6700;&#x591A;&#x7684; 100 &#x540D;&#x88AB;&#x6307;&#x5B9A;&#x4E3A;&#x9A8C;&#x8BC1;&#x8005;&#x3002;&#x4ED6;&#x4EEC;&#x6210;&#x4E3A;<strong>&#x9A8C;&#x8BC1;&#x8005;</strong> &#x5982;&#x679C;&#x9A8C;&#x8BC1;&#x8005;&#x7684;&#x603B;&#x80A1;&#x4EFD;&#x4F4E;&#x4E8E;&#x524D; 100 &#x540D;&#xFF0C;&#x90A3;&#x4E48;&#x8BE5;&#x9A8C;&#x8BC1;&#x8005;&#x5C06;&#x5931;&#x53BB;&#x5176;&#x9A8C;&#x8BC1;&#x8005;&#x7279;&#x6743;&#xFF1A;&#x4ED6;&#x4EEC;&#x4E0D;&#x518D;&#x53C2;&#x4E0E;&#x5171;&#x8BC6;&#x5E76;&#x4EA7;&#x751F;&#x5956;&#x52B1;&#x3002;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x7684;&#x63A8;&#x79FB;&#xFF0C;&#x9A8C;&#x8BC1;&#x8005;&#x7684;&#x6700;&#x5927;&#x6570;&#x91CF;&#x53EF;&#x80FD;&#x4F1A;&#x901A;&#x8FC7;&#x94FE;&#x4E0A;&#x6CBB;&#x7406;&#x63D0;&#x6848;&#x589E;&#x52A0;&#x3002;</p>
<h3 id="&#x6709;&#x54EA;&#x4E9B;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x5BC6;&#x94A5;&#xFF1F;">&#x6709;&#x54EA;&#x4E9B;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x5BC6;&#x94A5;&#xFF1F;</h3>
<p>&#x7B80;&#x800C;&#x8A00;&#x4E4B;&#xFF0C;&#x6709;&#x4E24;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x952E;&#xFF1A;</p>
<ul>
<li><strong>Tendermint Key</strong>&#xFF1A;&#x8FD9;&#x662F;&#x7528;&#x4E8E;&#x7B7E;&#x7F72;&#x5171;&#x8BC6;&#x6295;&#x7968;&#x7684;&#x552F;&#x4E00;&#x5BC6;&#x94A5;&#x3002;<ul>
<li>&#x5B83;&#x4E0E;&#x4E00;&#x4E2A;&#x516C;&#x94A5;<code>plugvalconspub</code>&#x76F8;&#x5173;&#x8054;&#xFF08;&#x4F7F;&#x7528;`plugchaind tenerm&#x83B7;&#x53D6;&#x8FD9;&#x4E2A;&#x503C;</li>
</ul>
</li>
</ul>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                
                <a href="validator-setup.html" class="navigation navigation-next navigation-unique" aria-label="Next page: 使用">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"介绍","level":"1.6.1","depth":2,"next":{"title":"使用","level":"1.6.2","depth":2,"path":"cn/validators/validator-setup.md","ref":"./cn/validators/validator-setup.md","articles":[]},"previous":{"title":"验证者","level":"1.6","depth":1,"ref":"","articles":[{"title":"介绍","level":"1.6.1","depth":2,"path":"cn/validators/validator-faq.md","ref":"./cn/validators/validator-faq.md","articles":[]},{"title":"使用","level":"1.6.2","depth":2,"path":"cn/validators/validator-setup.md","ref":"./cn/validators/validator-setup.md","articles":[]}]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"cn/validators/validator-faq.md","mtime":"2021-08-09T04:03:01.042Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-08-09T04:03:11.363Z"},"basePath":"../..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../../gitbook/gitbook.js"></script>
    <script src="../../gitbook/theme.js"></script>
    
        
        <script src="../../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

